package com.example.demo.building;

public enum BuildingEnum{
    LI("LI", "文華樓"), LF("LF", "文友樓"), LE("LE", "文開樓"),
    LP("LP", "積健樓"), LG("LG", "文學院研究所大樓"),
    AA("AA", "應用美術學系教室"), AL("AL", "景觀設計學系教室"),
    AM("AM", "音樂學系教室"), DG("DG", "舊醫學大樓"),
    MD("MD", "國璽樓"), LS("LS", "生命科學系"),
    CH("CH", "化學系"), LH("LH", "理工學院綜合教室"), MA("MA", "數學系"),
    PH("PH", "物理學系"), SF("SF", "聖言樓"), EP("EP", "食品工廠"),
    FC("FC", "輔幼教室"), HE("HE", "兒家、餐旅學系"), NF("NF", "食科、營養學系"),
    TC("TC", "織品服裝學系(朝橒樓)"), LA("LA", "外語A 大樓"), LB("LB", "外語B 大樓"),
    LC("LC", "外語C 大樓"), AV("AV", "外語視聽教室"), FL("FL", "翻譯研究所教室"),
    LW("LW", "樹德樓"), BS("BS", "伯達樓"), LM("LM", "利瑪竇樓"), JS("JS", "濟時樓"),
    SS("SS", "法園"), ES("ES", "進修部教學大樓"), CF("CF", "舒德樓"), FG("FG", "外語學院"),

    中美堂("中美堂", "中美堂"), 中美堂綜合教室("中美堂綜合教室", "中美堂綜合教室"),
    中美堂旁涼亭("中美堂旁涼亭", "中美堂旁涼亭"), 中美堂貴賓室("中美堂貴賓室", "中美堂貴賓室"),
    壘球場("壘球場", "壘球場"), 壘球場場地("壘球場場地", "壘球場場地"),
    排球場("排球場", "排球場"), 排球場場地("排球場場地", "排球場場地"),
    文德B1飛輪教室("文德B1飛輪教室", "文德B1飛輪教室"), 文德B1體適能中心("文德B1體適能中心", "文德B1體適能中心"),
    洪金寶7樓保齡球場("洪金寶7樓保齡球場", "洪金寶7樓保齡球場"), 游泳池("游泳池", "游泳池"), 游泳池場地("游泳池場地", "游泳池場地"),
    理工網球場("理工網球場", "理工網球場"), 田徑場("田徑場", "田徑場"), 籃球場("籃球場", "籃球場"), 籃球場場地("籃球場場地", "籃球場場地"),
    網球場("網球場", "網球場"), 足球場("足球場", "足球場"), 飛輪教室("飛輪教室", "飛輪教室"),


    A205("A205","A205"),CFL("CFL","CFL"),GM("GM","GM"),IJM("IJM","IJM"),JSB("JSB","JSB"),SL("SL","SL"),
    NAN("nan", "無值"), NotDecide("教室未定", "教室未定"), NoRoom("不需要教室", "不需要教室");
    public String symbolName, chineseName;

    private BuildingEnum(String symbolName, String s2) {
        this.symbolName = symbolName;
        this.chineseName = s2;
    }
}
